import AnimatedText from '@/components/AnimatedText'
import Layout from '@/components/Layout'
import Head from 'next/head'
import Image from 'next/image'
import profilePic from '../images/photo_me.jpg'

const about = () => {
	return (
		<>
			<Head>
				<title>GlebovDenis | AboutPage</title>
				<meta name='description' content='any description' />
			</Head>
			<main className='flex w-full flex-col items-center justify-center'>
				<Layout className='pt-16'>
					<AnimatedText
						text='Целеустремленность ведет к достижениям!'
						className='mb-16'
					/>
					<div className='grid w-full grid-cols-8 gap-16'>
						<div className='col-span-3 flex flex-col items-start justify-start'>
							<h2 className='mb-4 text-lg font-bold  text-dark/75'>Обо мне</h2>
							<p className='font-medium'>
								Привет! Меня зовут Денис, я - увлеченный и целеустремленный
								фронтенд-разработчик. Моя специализация - создание интерактивных
								и отзывчивых веб-приложений с использованием современных
								технологий. Я постоянно стремлюсь к профессиональному росту и
								освоению новых инструментов и методологий.
							</p>
							<p className='my-4 font-medium'>
								<span>Опыт и навыки</span>Хотя у меня еще нет коммерческого
								опыта, я компенсирую это своим огромным стремлением к
								саморазвитию и созданию собственных проектов. Я упорно работаю
								над улучшением своих навыков и освоением новых технологий, чтобы
								не отставать от текущих тенденций в мире веб-разработки. Мои
								проекты позволяют мне применять на практике знания, полученные
								из многочисленных обучающих материалов, книг и курсов.
							</p>
							<p className='my-4 font-medium'>
								<span>Мой подход</span>Я верю в важность чистого и читаемого
								кода, а также в постоянное обучение и совершенствование. В своей
								работе я всегда стараюсь использовать лучшие практики и искать
								оптимальные решения для поставленных задач. Я придерживаюсь
								следующих принципов: Чистый код: Пишу код, который легко читать
								и поддерживать, следуя принципам SOLID и DRY. Тестирование:
								Активно использую юнит-тестирование и интеграционное
								тестирование для обеспечения надежности и качества приложений.
								Документация: Понимаю важность документации и стараюсь всегда
								оставлять понятные комментарии и писать подробные README файлы.
							</p>
							<p className='my-4 font-medium'>
								<span>Цели</span>В ближайшем будущем я планирую углубить свои
								знания в области разработки на TypeScript, что позволит мне
								писать еще более надежный и масштабируемый код. Моя главная цель
								- создавать качественные и полезные продукты, которые приносят
								пользу пользователям и решают их реальные проблемы. Я стремлюсь
								к тому, чтобы каждый проект, над которым я работаю, был выполнен
								на высшем уровне и приносил удовлетворение как мне, так и моим
								клиентам и пользователям.
							</p>
							<p className='font-medium'>
								<span>Немного о себе</span>Помимо программирования, я увлекаюсь
								чтением литературы и путешествиями. Я считаю, что разнообразие
								интересов помогает оставаться креативным и находить
								нестандартные решения в работе. Я также активно занимаюсь
								спортом, что помогает мне поддерживать физическую форму и
								ментальное здоровье. Я убежден, что здоровый образ жизни
								положительно влияет на продуктивность и качество работы. Буду
								рад новым возможностям и интересным проектам! Если у вас есть
								идеи или предложения, не стесняйтесь связаться со мной.
							</p>
						</div>

						<div className='col-span-3 relative h-max rounded-2xl border-2 border-solid border-dark bg-light p-8 '>
							<div className='absolute top-0 -right-3 -z-10 w-[102%] h-[103%] rounded-[2rem] bg-dark'></div>
							<Image
								src={profilePic}
								alt='GlebovDenis'
								className='w-full h-auto rounded-2xl'
							/>
						</div>
					</div>
				</Layout>
			</main>
		</>
	)
}
export default about
