// Данные о себе
const aboutData = {
	intro: `
Меня зовут Денис, я — фронтенд-разработчик.
Специализируюсь на создании интерактивных и адаптивных веб-приложений с использованием современных технологий.
Постоянно развиваюсь как специалист, осваивая новые инструменты и подходы в разработке.
  `,
	experience: `
Начав как самоучка, я собрал за плечами не просто учебные, а проработанные проекты.
Среди них — настольное приложение для научной среды, интернет-магазин, мини-соцсеть и другие pet-проекты.
Мне важно не просто изучать технологии, а применять их на практике: продумывать архитектуру, заботиться об удобстве и качестве продукта.
  `,
	approach: `
Верю в силу чистого и понятного кода.
Всегда стремлюсь использовать лучшие практики, писать тестируемый и сопровождаемый код.
Постоянное обучение и рост — неотъемлемая часть моей работы.
  `,
	goals: `
Планирую углубиться в архитектуру, производительность, доступность и UX.
Моя цель — создавать стабильные и продуманные решения, которые приносят реальную пользу.
Хочу развиваться в проектах, где ценят качество, детали и результат.
  `,
	aboutMe: `
 Читаю, путешествую, регулярно занимаюсь спортом — это помогает сохранять баланс и креативность.
Уверен: здоровый ритм жизни напрямую влияет на продуктивность, а разнообразие интересов помогает находить нестандартные решения.
Я открыт к развитию, новым вызовам и всегда готов расти вместе с сильной командой.
  `,
}

export default aboutData
