const slides = [
	{
		id: 1,
		name: 'Angular Project: Task Manager',
		description:
			'Проект Task Manager – это веб-приложение, разработанное на базе Angular, предназначенное для управления задачами и проектами. Приложение позволяет пользователям создавать, редактировать и удалять задачи, а также отслеживать их выполнение. Основная цель проекта – предоставить удобный инструмент для организации работы и повышения продуктивности.',
		src: '/images/projects/Angular.png',
		srcGit: 'https://github.com/',
	},
	{
		id: 2,
		name: 'Next.js Project: Portfolio Website',
		description:
			'Проект Portfolio Website – это современное веб-приложение, созданное на базе Next.js. Это приложение предназначено для представления вашего личного или профессионального портфолио. Сайт позволяет демонстрировать ваши проекты, навыки и опыт работы в интерактивном и привлекательном формате. Основная цель проекта – предоставить платформу для эффективного представления ваших достижений и умений потенциальным работодателям или клиентам.',
		src: '/images/projects/NextJS.png',
		srcGit: 'https://github.com/',
	},
	{
		id: 3,
		name: 'React Project: E-commerce Platform',
		description:
			'Проект E-commerce Platform – это мощное веб-приложение, разработанное на базе React, предназначенное для создания интернет-магазинов. Приложение предоставляет все необходимые инструменты для управления продуктами, заказами и клиентами. Основная цель проекта – предоставить гибкую и масштабируемую платформу для торговли в интернете.',
		src: '/images/projects/React.png',
		srcGit: 'https://github.com/',
	},
	{
		id: 4,
		name: 'Redux Project: Expense Tracker',
		description:
			'Проект Expense Tracker – это удобное веб-приложение, разработанное на базе Redux и React, предназначенное для отслеживания расходов. Приложение позволяет пользователям вести учет своих доходов и расходов, анализировать финансовое состояние и планировать бюджет. Основная цель проекта – предоставить эффективный инструмент для управления личными финансами.',
		src: '/images/projects/Redux.png',
		srcGit: 'https://github.com/',
	},
]
export default slides
